/* automatically generated by rust-bindgen 0.69.5 */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 0;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C2X_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 39;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;

pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_uint;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_int;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
extern "C" {
    pub fn SherpaOnnxGetVersionStr() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn SherpaOnnxGetGitSha1() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn SherpaOnnxGetGitDate() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn SherpaOnnxFileExists(filename: *const ::std::os::raw::c_char) -> i32;
}
#[doc = " Please refer to\n https://k2-fsa.github.io/sherpa/onnx/pretrained_models/index.html\n to download pre-trained models. That is, you can find encoder-xxx.onnx\n decoder-xxx.onnx, joiner-xxx.onnx, and tokens.txt for this struct\n from there."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineTransducerModelConfig {
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
    pub joiner: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOnlineTransducerModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOnlineTransducerModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOnlineTransducerModelConfig>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOnlineTransducerModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOnlineTransducerModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOnlineTransducerModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoder) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineTransducerModelConfig),
            "::",
            stringify!(encoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decoder) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineTransducerModelConfig),
            "::",
            stringify!(decoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).joiner) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineTransducerModelConfig),
            "::",
            stringify!(joiner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineParaformerModelConfig {
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOnlineParaformerModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOnlineParaformerModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOnlineParaformerModelConfig>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOnlineParaformerModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOnlineParaformerModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOnlineParaformerModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoder) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineParaformerModelConfig),
            "::",
            stringify!(encoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decoder) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineParaformerModelConfig),
            "::",
            stringify!(decoder)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineZipformer2CtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOnlineZipformer2CtcModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOnlineZipformer2CtcModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOnlineZipformer2CtcModelConfig>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOnlineZipformer2CtcModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOnlineZipformer2CtcModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOnlineZipformer2CtcModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineZipformer2CtcModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineNemoCtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOnlineNemoCtcModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOnlineNemoCtcModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOnlineNemoCtcModelConfig>(),
        8usize,
        concat!("Size of: ", stringify!(SherpaOnnxOnlineNemoCtcModelConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOnlineNemoCtcModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOnlineNemoCtcModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineNemoCtcModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineToneCtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOnlineToneCtcModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOnlineToneCtcModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOnlineToneCtcModelConfig>(),
        8usize,
        concat!("Size of: ", stringify!(SherpaOnnxOnlineToneCtcModelConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOnlineToneCtcModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOnlineToneCtcModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineToneCtcModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineModelConfig {
    pub transducer: SherpaOnnxOnlineTransducerModelConfig,
    pub paraformer: SherpaOnnxOnlineParaformerModelConfig,
    pub zipformer2_ctc: SherpaOnnxOnlineZipformer2CtcModelConfig,
    pub tokens: *const ::std::os::raw::c_char,
    pub num_threads: i32,
    pub provider: *const ::std::os::raw::c_char,
    pub debug: i32,
    pub model_type: *const ::std::os::raw::c_char,
    pub modeling_unit: *const ::std::os::raw::c_char,
    pub bpe_vocab: *const ::std::os::raw::c_char,
    #[doc = " if non-null, loading the tokens from the buffer instead of from the\n \"tokens\" file"]
    pub tokens_buf: *const ::std::os::raw::c_char,
    #[doc = " byte size excluding the trailing '\\0'"]
    pub tokens_buf_size: i32,
    pub nemo_ctc: SherpaOnnxOnlineNemoCtcModelConfig,
    pub t_one_ctc: SherpaOnnxOnlineToneCtcModelConfig,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOnlineModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOnlineModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOnlineModelConfig>(),
        136usize,
        concat!("Size of: ", stringify!(SherpaOnnxOnlineModelConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOnlineModelConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxOnlineModelConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transducer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineModelConfig),
            "::",
            stringify!(transducer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paraformer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineModelConfig),
            "::",
            stringify!(paraformer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zipformer2_ctc) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineModelConfig),
            "::",
            stringify!(zipformer2_ctc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineModelConfig),
            "::",
            stringify!(tokens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_threads) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineModelConfig),
            "::",
            stringify!(num_threads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).provider) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineModelConfig),
            "::",
            stringify!(provider)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debug) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineModelConfig),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model_type) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineModelConfig),
            "::",
            stringify!(model_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modeling_unit) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineModelConfig),
            "::",
            stringify!(modeling_unit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bpe_vocab) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineModelConfig),
            "::",
            stringify!(bpe_vocab)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens_buf) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineModelConfig),
            "::",
            stringify!(tokens_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens_buf_size) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineModelConfig),
            "::",
            stringify!(tokens_buf_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nemo_ctc) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineModelConfig),
            "::",
            stringify!(nemo_ctc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_one_ctc) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineModelConfig),
            "::",
            stringify!(t_one_ctc)
        )
    );
}
#[doc = " It expects 16 kHz 16-bit single channel wave format."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxFeatureConfig {
    #[doc = " Sample rate of the input data. MUST match the one expected\n by the model. For instance, it should be 16000 for models provided\n by us."]
    pub sample_rate: i32,
    #[doc = " Feature dimension of the model.\n For instance, it should be 80 for models provided by us."]
    pub feature_dim: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxFeatureConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxFeatureConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxFeatureConfig>(),
        8usize,
        concat!("Size of: ", stringify!(SherpaOnnxFeatureConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxFeatureConfig>(),
        4usize,
        concat!("Alignment of ", stringify!(SherpaOnnxFeatureConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample_rate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxFeatureConfig),
            "::",
            stringify!(sample_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).feature_dim) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxFeatureConfig),
            "::",
            stringify!(feature_dim)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineCtcFstDecoderConfig {
    pub graph: *const ::std::os::raw::c_char,
    pub max_active: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOnlineCtcFstDecoderConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOnlineCtcFstDecoderConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOnlineCtcFstDecoderConfig>(),
        16usize,
        concat!("Size of: ", stringify!(SherpaOnnxOnlineCtcFstDecoderConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOnlineCtcFstDecoderConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOnlineCtcFstDecoderConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).graph) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineCtcFstDecoderConfig),
            "::",
            stringify!(graph)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_active) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineCtcFstDecoderConfig),
            "::",
            stringify!(max_active)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxHomophoneReplacerConfig {
    pub dict_dir: *const ::std::os::raw::c_char,
    pub lexicon: *const ::std::os::raw::c_char,
    pub rule_fsts: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxHomophoneReplacerConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxHomophoneReplacerConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxHomophoneReplacerConfig>(),
        24usize,
        concat!("Size of: ", stringify!(SherpaOnnxHomophoneReplacerConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxHomophoneReplacerConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxHomophoneReplacerConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dict_dir) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxHomophoneReplacerConfig),
            "::",
            stringify!(dict_dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lexicon) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxHomophoneReplacerConfig),
            "::",
            stringify!(lexicon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rule_fsts) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxHomophoneReplacerConfig),
            "::",
            stringify!(rule_fsts)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineRecognizerConfig {
    pub feat_config: SherpaOnnxFeatureConfig,
    pub model_config: SherpaOnnxOnlineModelConfig,
    #[doc = " Possible values are: greedy_search, modified_beam_search"]
    pub decoding_method: *const ::std::os::raw::c_char,
    #[doc = " Used only when decoding_method is modified_beam_search\n Example value: 4"]
    pub max_active_paths: i32,
    #[doc = " 0 to disable endpoint detection.\n A non-zero value to enable endpoint detection."]
    pub enable_endpoint: i32,
    #[doc = " An endpoint is detected if trailing silence in seconds is larger than\n this value even if nothing has been decoded.\n Used only when enable_endpoint is not 0."]
    pub rule1_min_trailing_silence: f32,
    #[doc = " An endpoint is detected if trailing silence in seconds is larger than\n this value after something that is not blank has been decoded.\n Used only when enable_endpoint is not 0."]
    pub rule2_min_trailing_silence: f32,
    #[doc = " An endpoint is detected if the utterance in seconds is larger than\n this value.\n Used only when enable_endpoint is not 0."]
    pub rule3_min_utterance_length: f32,
    #[doc = " Path to the hotwords."]
    pub hotwords_file: *const ::std::os::raw::c_char,
    #[doc = " Bonus score for each token in hotwords."]
    pub hotwords_score: f32,
    pub ctc_fst_decoder_config: SherpaOnnxOnlineCtcFstDecoderConfig,
    pub rule_fsts: *const ::std::os::raw::c_char,
    pub rule_fars: *const ::std::os::raw::c_char,
    pub blank_penalty: f32,
    #[doc = " if non-nullptr, loading the hotwords from the buffered string directly in"]
    pub hotwords_buf: *const ::std::os::raw::c_char,
    #[doc = " byte size excluding the tailing '\\0'"]
    pub hotwords_buf_size: i32,
    pub hr: SherpaOnnxHomophoneReplacerConfig,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOnlineRecognizerConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOnlineRecognizerConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOnlineRecognizerConfig>(),
        272usize,
        concat!("Size of: ", stringify!(SherpaOnnxOnlineRecognizerConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOnlineRecognizerConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOnlineRecognizerConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).feat_config) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(feat_config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model_config) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(model_config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decoding_method) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(decoding_method)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_active_paths) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(max_active_paths)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable_endpoint) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(enable_endpoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rule1_min_trailing_silence) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(rule1_min_trailing_silence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rule2_min_trailing_silence) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(rule2_min_trailing_silence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rule3_min_utterance_length) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(rule3_min_utterance_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hotwords_file) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(hotwords_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hotwords_score) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(hotwords_score)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctc_fst_decoder_config) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(ctc_fst_decoder_config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rule_fsts) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(rule_fsts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rule_fars) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(rule_fars)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).blank_penalty) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(blank_penalty)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hotwords_buf) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(hotwords_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hotwords_buf_size) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(hotwords_buf_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hr) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerConfig),
            "::",
            stringify!(hr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineRecognizerResult {
    pub text: *const ::std::os::raw::c_char,
    pub tokens: *const ::std::os::raw::c_char,
    pub tokens_arr: *const *const ::std::os::raw::c_char,
    pub timestamps: *mut f32,
    pub count: i32,
    #[doc = " Return a json string.\n\n The returned string contains:\n   {\n     \"text\": \"The recognition result\",\n     \"tokens\": [x, x, x],\n     \"timestamps\": [x, x, x],\n     \"segment\": x,\n     \"start_time\": x,\n     \"is_final\": true|false\n   }"]
    pub json: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOnlineRecognizerResult() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOnlineRecognizerResult> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOnlineRecognizerResult>(),
        48usize,
        concat!("Size of: ", stringify!(SherpaOnnxOnlineRecognizerResult))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOnlineRecognizerResult>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOnlineRecognizerResult)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).text) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerResult),
            "::",
            stringify!(text)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerResult),
            "::",
            stringify!(tokens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens_arr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerResult),
            "::",
            stringify!(tokens_arr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamps) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerResult),
            "::",
            stringify!(timestamps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerResult),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).json) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlineRecognizerResult),
            "::",
            stringify!(json)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineRecognizer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineStream {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " @param config  Config for the recognizer.\n @return Return a pointer to the recognizer. The user has to invoke"]
    pub fn SherpaOnnxCreateOnlineRecognizer(
        config: *const SherpaOnnxOnlineRecognizerConfig,
    ) -> *const SherpaOnnxOnlineRecognizer;
}
extern "C" {
    #[doc = " Free a pointer returned by SherpaOnnxCreateOnlineRecognizer()\n\n @param p A pointer returned by SherpaOnnxCreateOnlineRecognizer()"]
    pub fn SherpaOnnxDestroyOnlineRecognizer(recognizer: *const SherpaOnnxOnlineRecognizer);
}
extern "C" {
    #[doc = " Create an online stream for accepting wave samples.\n\n @param recognizer  A pointer returned by SherpaOnnxCreateOnlineRecognizer()\n @return Return a pointer to an OnlineStream. The user has to invoke\n         SherpaOnnxDestroyOnlineStream() to free it to avoid memory leak."]
    pub fn SherpaOnnxCreateOnlineStream(
        recognizer: *const SherpaOnnxOnlineRecognizer,
    ) -> *const SherpaOnnxOnlineStream;
}
extern "C" {
    #[doc = " Create an online stream for accepting wave samples with the specified hot\n words.\n\n @param recognizer  A pointer returned by SherpaOnnxCreateOnlineRecognizer()\n @return Return a pointer to an OnlineStream. The user has to invoke\n         SherpaOnnxDestroyOnlineStream() to free it to avoid memory leak."]
    pub fn SherpaOnnxCreateOnlineStreamWithHotwords(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        hotwords: *const ::std::os::raw::c_char,
    ) -> *const SherpaOnnxOnlineStream;
}
extern "C" {
    #[doc = " Destroy an online stream.\n\n @param stream A pointer returned by SherpaOnnxCreateOnlineStream()"]
    pub fn SherpaOnnxDestroyOnlineStream(stream: *const SherpaOnnxOnlineStream);
}
extern "C" {
    #[doc = " Accept input audio samples and compute the features.\n The user has to invoke SherpaOnnxDecodeOnlineStream() to run the neural\n network and decoding.\n\n @param stream  A pointer returned by SherpaOnnxCreateOnlineStream().\n @param sample_rate  Sample rate of the input samples. If it is different\n                     from config.feat_config.sample_rate, we will do\n                     resampling inside sherpa-onnx.\n @param samples A pointer to a 1-D array containing audio samples.\n                The range of samples has to be normalized to [-1, 1].\n @param n  Number of elements in the samples array."]
    pub fn SherpaOnnxOnlineStreamAcceptWaveform(
        stream: *const SherpaOnnxOnlineStream,
        sample_rate: i32,
        samples: *const f32,
        n: i32,
    );
}
extern "C" {
    #[doc = " Return 1 if there are enough number of feature frames for decoding.\n Return 0 otherwise.\n\n @param recognizer  A pointer returned by SherpaOnnxCreateOnlineRecognizer\n @param stream  A pointer returned by SherpaOnnxCreateOnlineStream"]
    pub fn SherpaOnnxIsOnlineStreamReady(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        stream: *const SherpaOnnxOnlineStream,
    ) -> i32;
}
extern "C" {
    #[doc = " Precondition for this function: SherpaOnnxIsOnlineStreamReady() MUST\n return 1.\n\n Usage example:\n\n  while (SherpaOnnxIsOnlineStreamReady(recognizer, stream)) {\n     SherpaOnnxDecodeOnlineStream(recognizer, stream);\n  }\n"]
    pub fn SherpaOnnxDecodeOnlineStream(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        stream: *const SherpaOnnxOnlineStream,
    );
}
extern "C" {
    #[doc = " This function is similar to SherpaOnnxDecodeOnlineStream(). It decodes\n multiple OnlineStream in parallel.\n\n Caution: The caller has to ensure each OnlineStream is ready, i.e.,\n SherpaOnnxIsOnlineStreamReady() for that stream should return 1.\n\n @param recognizer  A pointer returned by SherpaOnnxCreateOnlineRecognizer()\n @param streams  A pointer array containing pointers returned by\n                 SherpaOnnxCreateOnlineRecognizer()\n @param n  Number of elements in the given streams array."]
    pub fn SherpaOnnxDecodeMultipleOnlineStreams(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        streams: *mut *const SherpaOnnxOnlineStream,
        n: i32,
    );
}
extern "C" {
    #[doc = " Get the decoding results so far for an OnlineStream.\n\n @param recognizer A pointer returned by SherpaOnnxCreateOnlineRecognizer().\n @param stream A pointer returned by SherpaOnnxCreateOnlineStream().\n @return A pointer containing the result. The user has to invoke\n         SherpaOnnxDestroyOnlineRecognizerResult() to free the returned\n         pointer to avoid memory leak."]
    pub fn SherpaOnnxGetOnlineStreamResult(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        stream: *const SherpaOnnxOnlineStream,
    ) -> *const SherpaOnnxOnlineRecognizerResult;
}
extern "C" {
    #[doc = " Destroy the pointer returned by SherpaOnnxGetOnlineStreamResult().\n\n @param r A pointer returned by SherpaOnnxGetOnlineStreamResult()"]
    pub fn SherpaOnnxDestroyOnlineRecognizerResult(r: *const SherpaOnnxOnlineRecognizerResult);
}
extern "C" {
    #[doc = " Return the result as a json string.\n The user has to invoke\n SherpaOnnxDestroyOnlineStreamResultJson()\n to free the returned pointer to avoid memory leak"]
    pub fn SherpaOnnxGetOnlineStreamResultAsJson(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        stream: *const SherpaOnnxOnlineStream,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn SherpaOnnxDestroyOnlineStreamResultJson(s: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " SherpaOnnxOnlineStreamReset an OnlineStream , which clears the neural\n network model state and the state for decoding.\n\n @param recognizer A pointer returned by SherpaOnnxCreateOnlineRecognizer().\n @param stream A pointer returned by SherpaOnnxCreateOnlineStream"]
    pub fn SherpaOnnxOnlineStreamReset(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        stream: *const SherpaOnnxOnlineStream,
    );
}
extern "C" {
    #[doc = " Signal that no more audio samples would be available.\n After this call, you cannot call SherpaOnnxOnlineStreamAcceptWaveform() any\n more.\n\n @param stream A pointer returned by SherpaOnnxCreateOnlineStream()"]
    pub fn SherpaOnnxOnlineStreamInputFinished(stream: *const SherpaOnnxOnlineStream);
}
extern "C" {
    #[doc = " Return 1 if an endpoint has been detected.\n\n @param recognizer A pointer returned by SherpaOnnxCreateOnlineRecognizer()\n @param stream A pointer returned by SherpaOnnxCreateOnlineStream()\n @return Return 1 if an endpoint is detected. Return 0 otherwise."]
    pub fn SherpaOnnxOnlineStreamIsEndpoint(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        stream: *const SherpaOnnxOnlineStream,
    ) -> i32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxDisplay {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Create a display object. Must be freed using SherpaOnnxDestroyDisplay to\n avoid memory leak."]
    pub fn SherpaOnnxCreateDisplay(max_word_per_line: i32) -> *const SherpaOnnxDisplay;
}
extern "C" {
    pub fn SherpaOnnxDestroyDisplay(display: *const SherpaOnnxDisplay);
}
extern "C" {
    #[doc = " Print the result."]
    pub fn SherpaOnnxPrint(
        display: *const SherpaOnnxDisplay,
        idx: i32,
        s: *const ::std::os::raw::c_char,
    );
}
#[doc = " Please refer to\n https://k2-fsa.github.io/sherpa/onnx/pretrained_models/index.html\n to download pre-trained models. That is, you can find encoder-xxx.onnx\n decoder-xxx.onnx, and joiner-xxx.onnx for this struct\n from there."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTransducerModelConfig {
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
    pub joiner: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineTransducerModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineTransducerModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineTransducerModelConfig>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineTransducerModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineTransducerModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineTransducerModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoder) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTransducerModelConfig),
            "::",
            stringify!(encoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decoder) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTransducerModelConfig),
            "::",
            stringify!(decoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).joiner) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTransducerModelConfig),
            "::",
            stringify!(joiner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineParaformerModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineParaformerModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineParaformerModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineParaformerModelConfig>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineParaformerModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineParaformerModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineParaformerModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineParaformerModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineNemoEncDecCtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineNemoEncDecCtcModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineNemoEncDecCtcModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineNemoEncDecCtcModelConfig>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineNemoEncDecCtcModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineNemoEncDecCtcModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineNemoEncDecCtcModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineNemoEncDecCtcModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineWhisperModelConfig {
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
    pub language: *const ::std::os::raw::c_char,
    pub task: *const ::std::os::raw::c_char,
    pub tail_paddings: i32,
    pub enable_token_timestamps: i32,
    pub enable_segment_timestamps: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineWhisperModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineWhisperModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineWhisperModelConfig>(),
        48usize,
        concat!("Size of: ", stringify!(SherpaOnnxOfflineWhisperModelConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineWhisperModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineWhisperModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoder) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineWhisperModelConfig),
            "::",
            stringify!(encoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decoder) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineWhisperModelConfig),
            "::",
            stringify!(decoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).language) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineWhisperModelConfig),
            "::",
            stringify!(language)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).task) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineWhisperModelConfig),
            "::",
            stringify!(task)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tail_paddings) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineWhisperModelConfig),
            "::",
            stringify!(tail_paddings)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable_token_timestamps) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineWhisperModelConfig),
            "::",
            stringify!(enable_token_timestamps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable_segment_timestamps) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineWhisperModelConfig),
            "::",
            stringify!(enable_segment_timestamps)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineCanaryModelConfig {
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
    pub src_lang: *const ::std::os::raw::c_char,
    pub tgt_lang: *const ::std::os::raw::c_char,
    pub use_pnc: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineCanaryModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineCanaryModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineCanaryModelConfig>(),
        40usize,
        concat!("Size of: ", stringify!(SherpaOnnxOfflineCanaryModelConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineCanaryModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineCanaryModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoder) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineCanaryModelConfig),
            "::",
            stringify!(encoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decoder) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineCanaryModelConfig),
            "::",
            stringify!(decoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).src_lang) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineCanaryModelConfig),
            "::",
            stringify!(src_lang)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tgt_lang) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineCanaryModelConfig),
            "::",
            stringify!(tgt_lang)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_pnc) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineCanaryModelConfig),
            "::",
            stringify!(use_pnc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineFireRedAsrModelConfig {
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineFireRedAsrModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineFireRedAsrModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineFireRedAsrModelConfig>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineFireRedAsrModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineFireRedAsrModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineFireRedAsrModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoder) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFireRedAsrModelConfig),
            "::",
            stringify!(encoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decoder) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFireRedAsrModelConfig),
            "::",
            stringify!(decoder)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineFireRedAsrCtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineFireRedAsrCtcModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineFireRedAsrCtcModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineFireRedAsrCtcModelConfig>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineFireRedAsrCtcModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineFireRedAsrCtcModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineFireRedAsrCtcModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFireRedAsrCtcModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineMoonshineModelConfig {
    pub preprocessor: *const ::std::os::raw::c_char,
    pub encoder: *const ::std::os::raw::c_char,
    pub uncached_decoder: *const ::std::os::raw::c_char,
    pub cached_decoder: *const ::std::os::raw::c_char,
    pub merged_decoder: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineMoonshineModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineMoonshineModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineMoonshineModelConfig>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineMoonshineModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineMoonshineModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineMoonshineModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).preprocessor) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineMoonshineModelConfig),
            "::",
            stringify!(preprocessor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoder) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineMoonshineModelConfig),
            "::",
            stringify!(encoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uncached_decoder) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineMoonshineModelConfig),
            "::",
            stringify!(uncached_decoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cached_decoder) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineMoonshineModelConfig),
            "::",
            stringify!(cached_decoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).merged_decoder) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineMoonshineModelConfig),
            "::",
            stringify!(merged_decoder)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTdnnModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineTdnnModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineTdnnModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineTdnnModelConfig>(),
        8usize,
        concat!("Size of: ", stringify!(SherpaOnnxOfflineTdnnModelConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineTdnnModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineTdnnModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTdnnModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineLMConfig {
    pub model: *const ::std::os::raw::c_char,
    pub scale: f32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineLMConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineLMConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineLMConfig>(),
        16usize,
        concat!("Size of: ", stringify!(SherpaOnnxOfflineLMConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineLMConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxOfflineLMConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineLMConfig),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineLMConfig),
            "::",
            stringify!(scale)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSenseVoiceModelConfig {
    pub model: *const ::std::os::raw::c_char,
    pub language: *const ::std::os::raw::c_char,
    pub use_itn: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineSenseVoiceModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineSenseVoiceModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineSenseVoiceModelConfig>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineSenseVoiceModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineSenseVoiceModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineSenseVoiceModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSenseVoiceModelConfig),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).language) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSenseVoiceModelConfig),
            "::",
            stringify!(language)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_itn) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSenseVoiceModelConfig),
            "::",
            stringify!(use_itn)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineDolphinModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineDolphinModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineDolphinModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineDolphinModelConfig>(),
        8usize,
        concat!("Size of: ", stringify!(SherpaOnnxOfflineDolphinModelConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineDolphinModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineDolphinModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineDolphinModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineZipformerCtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineZipformerCtcModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineZipformerCtcModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineZipformerCtcModelConfig>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineZipformerCtcModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineZipformerCtcModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineZipformerCtcModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineZipformerCtcModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineWenetCtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineWenetCtcModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineWenetCtcModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineWenetCtcModelConfig>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineWenetCtcModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineWenetCtcModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineWenetCtcModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineWenetCtcModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineOmnilingualAsrCtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineOmnilingualAsrCtcModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineOmnilingualAsrCtcModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineOmnilingualAsrCtcModelConfig>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineOmnilingualAsrCtcModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineOmnilingualAsrCtcModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineOmnilingualAsrCtcModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineOmnilingualAsrCtcModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineFunASRNanoModelConfig {
    pub encoder_adaptor: *const ::std::os::raw::c_char,
    pub llm: *const ::std::os::raw::c_char,
    pub embedding: *const ::std::os::raw::c_char,
    pub tokenizer: *const ::std::os::raw::c_char,
    pub system_prompt: *const ::std::os::raw::c_char,
    pub user_prompt: *const ::std::os::raw::c_char,
    pub max_new_tokens: i32,
    pub temperature: f32,
    pub top_p: f32,
    pub seed: i32,
    pub language: *const ::std::os::raw::c_char,
    pub itn: i32,
    pub hotwords: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineFunASRNanoModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineFunASRNanoModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineFunASRNanoModelConfig>(),
        88usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineFunASRNanoModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoder_adaptor) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig),
            "::",
            stringify!(encoder_adaptor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).llm) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig),
            "::",
            stringify!(llm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).embedding) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig),
            "::",
            stringify!(embedding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokenizer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig),
            "::",
            stringify!(tokenizer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).system_prompt) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig),
            "::",
            stringify!(system_prompt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user_prompt) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig),
            "::",
            stringify!(user_prompt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_new_tokens) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig),
            "::",
            stringify!(max_new_tokens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).temperature) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig),
            "::",
            stringify!(temperature)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).top_p) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig),
            "::",
            stringify!(top_p)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seed) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig),
            "::",
            stringify!(seed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).language) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig),
            "::",
            stringify!(language)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).itn) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig),
            "::",
            stringify!(itn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hotwords) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineFunASRNanoModelConfig),
            "::",
            stringify!(hotwords)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineMedAsrCtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineMedAsrCtcModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineMedAsrCtcModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineMedAsrCtcModelConfig>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineMedAsrCtcModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineMedAsrCtcModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineMedAsrCtcModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineMedAsrCtcModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineModelConfig {
    pub transducer: SherpaOnnxOfflineTransducerModelConfig,
    pub paraformer: SherpaOnnxOfflineParaformerModelConfig,
    pub nemo_ctc: SherpaOnnxOfflineNemoEncDecCtcModelConfig,
    pub whisper: SherpaOnnxOfflineWhisperModelConfig,
    pub tdnn: SherpaOnnxOfflineTdnnModelConfig,
    pub tokens: *const ::std::os::raw::c_char,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
    pub model_type: *const ::std::os::raw::c_char,
    pub modeling_unit: *const ::std::os::raw::c_char,
    pub bpe_vocab: *const ::std::os::raw::c_char,
    pub telespeech_ctc: *const ::std::os::raw::c_char,
    pub sense_voice: SherpaOnnxOfflineSenseVoiceModelConfig,
    pub moonshine: SherpaOnnxOfflineMoonshineModelConfig,
    pub fire_red_asr: SherpaOnnxOfflineFireRedAsrModelConfig,
    pub dolphin: SherpaOnnxOfflineDolphinModelConfig,
    pub zipformer_ctc: SherpaOnnxOfflineZipformerCtcModelConfig,
    pub canary: SherpaOnnxOfflineCanaryModelConfig,
    pub wenet_ctc: SherpaOnnxOfflineWenetCtcModelConfig,
    pub omnilingual: SherpaOnnxOfflineOmnilingualAsrCtcModelConfig,
    pub medasr: SherpaOnnxOfflineMedAsrCtcModelConfig,
    pub funasr_nano: SherpaOnnxOfflineFunASRNanoModelConfig,
    pub fire_red_asr_ctc: SherpaOnnxOfflineFireRedAsrCtcModelConfig,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineModelConfig>(),
        408usize,
        concat!("Size of: ", stringify!(SherpaOnnxOfflineModelConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineModelConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxOfflineModelConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transducer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(transducer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paraformer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(paraformer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nemo_ctc) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(nemo_ctc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).whisper) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(whisper)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tdnn) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(tdnn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(tokens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_threads) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(num_threads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debug) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).provider) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(provider)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model_type) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(model_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modeling_unit) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(modeling_unit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bpe_vocab) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(bpe_vocab)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).telespeech_ctc) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(telespeech_ctc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sense_voice) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(sense_voice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).moonshine) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(moonshine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fire_red_asr) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(fire_red_asr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dolphin) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(dolphin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zipformer_ctc) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(zipformer_ctc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).canary) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(canary)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wenet_ctc) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(wenet_ctc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).omnilingual) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(omnilingual)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).medasr) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(medasr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).funasr_nano) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(funasr_nano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fire_red_asr_ctc) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineModelConfig),
            "::",
            stringify!(fire_red_asr_ctc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineRecognizerConfig {
    pub feat_config: SherpaOnnxFeatureConfig,
    pub model_config: SherpaOnnxOfflineModelConfig,
    pub lm_config: SherpaOnnxOfflineLMConfig,
    pub decoding_method: *const ::std::os::raw::c_char,
    pub max_active_paths: i32,
    #[doc = " Path to the hotwords."]
    pub hotwords_file: *const ::std::os::raw::c_char,
    #[doc = " Bonus score for each token in hotwords."]
    pub hotwords_score: f32,
    pub rule_fsts: *const ::std::os::raw::c_char,
    pub rule_fars: *const ::std::os::raw::c_char,
    pub blank_penalty: f32,
    pub hr: SherpaOnnxHomophoneReplacerConfig,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineRecognizerConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineRecognizerConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineRecognizerConfig>(),
        512usize,
        concat!("Size of: ", stringify!(SherpaOnnxOfflineRecognizerConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineRecognizerConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineRecognizerConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).feat_config) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerConfig),
            "::",
            stringify!(feat_config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model_config) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerConfig),
            "::",
            stringify!(model_config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lm_config) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerConfig),
            "::",
            stringify!(lm_config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decoding_method) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerConfig),
            "::",
            stringify!(decoding_method)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_active_paths) as usize - ptr as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerConfig),
            "::",
            stringify!(max_active_paths)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hotwords_file) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerConfig),
            "::",
            stringify!(hotwords_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hotwords_score) as usize - ptr as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerConfig),
            "::",
            stringify!(hotwords_score)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rule_fsts) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerConfig),
            "::",
            stringify!(rule_fsts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rule_fars) as usize - ptr as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerConfig),
            "::",
            stringify!(rule_fars)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).blank_penalty) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerConfig),
            "::",
            stringify!(blank_penalty)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hr) as usize - ptr as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerConfig),
            "::",
            stringify!(hr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineRecognizer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineStream {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " @param config  Config for the recognizer.\n @return Return a pointer to the recognizer. The user has to invoke"]
    pub fn SherpaOnnxCreateOfflineRecognizer(
        config: *const SherpaOnnxOfflineRecognizerConfig,
    ) -> *const SherpaOnnxOfflineRecognizer;
}
extern "C" {
    #[doc = " @param config  Config for the recognizer."]
    pub fn SherpaOnnxOfflineRecognizerSetConfig(
        recognizer: *const SherpaOnnxOfflineRecognizer,
        config: *const SherpaOnnxOfflineRecognizerConfig,
    );
}
extern "C" {
    #[doc = " Free a pointer returned by SherpaOnnxCreateOfflineRecognizer()\n\n @param p A pointer returned by SherpaOnnxCreateOfflineRecognizer()"]
    pub fn SherpaOnnxDestroyOfflineRecognizer(recognizer: *const SherpaOnnxOfflineRecognizer);
}
extern "C" {
    #[doc = " Create an offline stream for accepting wave samples.\n\n @param recognizer  A pointer returned by SherpaOnnxCreateOfflineRecognizer()\n @return Return a pointer to an OfflineStream. The user has to invoke\n         SherpaOnnxDestroyOfflineStream() to free it to avoid memory leak."]
    pub fn SherpaOnnxCreateOfflineStream(
        recognizer: *const SherpaOnnxOfflineRecognizer,
    ) -> *const SherpaOnnxOfflineStream;
}
extern "C" {
    #[doc = " Create an offline stream for accepting wave samples with the specified hot\n words.\n\n @param recognizer  A pointer returned by SherpaOnnxCreateOfflineRecognizer()\n @return Return a pointer to an OfflineStream. The user has to invoke\n         SherpaOnnxDestroyOfflineStream() to free it to avoid memory leak."]
    pub fn SherpaOnnxCreateOfflineStreamWithHotwords(
        recognizer: *const SherpaOnnxOfflineRecognizer,
        hotwords: *const ::std::os::raw::c_char,
    ) -> *const SherpaOnnxOfflineStream;
}
extern "C" {
    #[doc = " Destroy an offline stream.\n\n @param stream A pointer returned by SherpaOnnxCreateOfflineStream()"]
    pub fn SherpaOnnxDestroyOfflineStream(stream: *const SherpaOnnxOfflineStream);
}
extern "C" {
    #[doc = " Accept input audio samples and compute the features.\n The user has to invoke SherpaOnnxDecodeOfflineStream() to run the neural\n network and decoding.\n\n @param stream  A pointer returned by SherpaOnnxCreateOfflineStream().\n @param sample_rate  Sample rate of the input samples. If it is different\n                     from config.feat_config.sample_rate, we will do\n                     resampling inside sherpa-onnx.\n @param samples A pointer to a 1-D array containing audio samples.\n                The range of samples has to be normalized to [-1, 1].\n @param n  Number of elements in the samples array.\n\n @caution: For each offline stream, please invoke this function only once!"]
    pub fn SherpaOnnxAcceptWaveformOffline(
        stream: *const SherpaOnnxOfflineStream,
        sample_rate: i32,
        samples: *const f32,
        n: i32,
    );
}
extern "C" {
    #[doc = " Decode an offline stream.\n\n We assume you have invoked SherpaOnnxAcceptWaveformOffline() for the given\n stream before calling this function.\n\n @param recognizer A pointer returned by SherpaOnnxCreateOfflineRecognizer().\n @param stream A pointer returned by SherpaOnnxCreateOfflineStream()"]
    pub fn SherpaOnnxDecodeOfflineStream(
        recognizer: *const SherpaOnnxOfflineRecognizer,
        stream: *const SherpaOnnxOfflineStream,
    );
}
extern "C" {
    #[doc = " Decode a list offline streams in parallel.\n\n We assume you have invoked SherpaOnnxAcceptWaveformOffline() for each stream\n before calling this function.\n\n @param recognizer A pointer returned by SherpaOnnxCreateOfflineRecognizer().\n @param streams A pointer pointer array containing pointers returned\n                by SherpaOnnxCreateOfflineStream().\n @param n Number of entries in the given streams."]
    pub fn SherpaOnnxDecodeMultipleOfflineStreams(
        recognizer: *const SherpaOnnxOfflineRecognizer,
        streams: *mut *const SherpaOnnxOfflineStream,
        n: i32,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineRecognizerResult {
    pub text: *const ::std::os::raw::c_char,
    pub timestamps: *mut f32,
    pub count: i32,
    pub tokens: *const ::std::os::raw::c_char,
    pub tokens_arr: *const *const ::std::os::raw::c_char,
    #[doc = " Return a json string.\n\n The returned string contains:\n   {\n     \"text\": \"The recognition result\",\n     \"tokens\": [x, x, x],\n     \"timestamps\": [x, x, x],\n     \"durations\": [x, x, x],\n     \"segment\": x,\n     \"start_time\": x,\n     \"is_final\": true|false\n   }"]
    pub json: *const ::std::os::raw::c_char,
    pub lang: *const ::std::os::raw::c_char,
    pub emotion: *const ::std::os::raw::c_char,
    pub event: *const ::std::os::raw::c_char,
    pub durations: *mut f32,
    pub ys_log_probs: *mut f32,
    pub segment_timestamps: *const f32,
    pub segment_durations: *const f32,
    pub segment_texts: *const ::std::os::raw::c_char,
    pub segment_texts_arr: *const *const ::std::os::raw::c_char,
    pub segment_count: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineRecognizerResult() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineRecognizerResult> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineRecognizerResult>(),
        128usize,
        concat!("Size of: ", stringify!(SherpaOnnxOfflineRecognizerResult))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineRecognizerResult>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineRecognizerResult)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).text) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(text)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamps) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(timestamps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(tokens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens_arr) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(tokens_arr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).json) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(json)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lang) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(lang)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).emotion) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(emotion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).event) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(event)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).durations) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(durations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ys_log_probs) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(ys_log_probs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segment_timestamps) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(segment_timestamps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segment_durations) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(segment_durations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segment_texts) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(segment_texts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segment_texts_arr) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(segment_texts_arr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segment_count) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineRecognizerResult),
            "::",
            stringify!(segment_count)
        )
    );
}
extern "C" {
    #[doc = " Get the result of the offline stream.\n\n We assume you have called SherpaOnnxDecodeOfflineStream() or\n SherpaOnnxDecodeMultipleOfflineStreams() with the given stream before\n calling this function.\n\n @param stream A pointer returned by SherpaOnnxCreateOfflineStream().\n @return Return a pointer to the result. The user has to invoke\n         SherpaOnnxDestroyOnlineRecognizerResult() to free the returned\n         pointer to avoid memory leak."]
    pub fn SherpaOnnxGetOfflineStreamResult(
        stream: *const SherpaOnnxOfflineStream,
    ) -> *const SherpaOnnxOfflineRecognizerResult;
}
extern "C" {
    #[doc = " Destroy the pointer returned by SherpaOnnxGetOfflineStreamResult().\n\n @param r A pointer returned by SherpaOnnxGetOfflineStreamResult()"]
    pub fn SherpaOnnxDestroyOfflineRecognizerResult(r: *const SherpaOnnxOfflineRecognizerResult);
}
extern "C" {
    #[doc = " Return the result as a json string.\n The user has to use SherpaOnnxDestroyOfflineStreamResultJson()\n to free the returned pointer to avoid memory leak"]
    pub fn SherpaOnnxGetOfflineStreamResultAsJson(
        stream: *const SherpaOnnxOfflineStream,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn SherpaOnnxDestroyOfflineStreamResultJson(s: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxKeywordResult {
    #[doc = " The triggered keyword.\n For English, it consists of space separated words.\n For Chinese, it consists of Chinese words without spaces.\n Example 1: \"hello world\"\n Example 2: \"你好世界\""]
    pub keyword: *const ::std::os::raw::c_char,
    #[doc = " Decoded results at the token level.\n For instance, for BPE-based models it consists of a list of BPE tokens."]
    pub tokens: *const ::std::os::raw::c_char,
    pub tokens_arr: *const *const ::std::os::raw::c_char,
    pub count: i32,
    #[doc = " timestamps.size() == tokens.size()\n timestamps[i] records the time in seconds when tokens[i] is decoded."]
    pub timestamps: *mut f32,
    #[doc = " Starting time of this segment.\n When an endpoint is detected, it will change"]
    pub start_time: f32,
    #[doc = " Return a json string.\n\n The returned string contains:\n   {\n     \"keyword\": \"The triggered keyword\",\n     \"tokens\": [x, x, x],\n     \"timestamps\": [x, x, x],\n     \"start_time\": x,\n   }"]
    pub json: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxKeywordResult() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxKeywordResult> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxKeywordResult>(),
        56usize,
        concat!("Size of: ", stringify!(SherpaOnnxKeywordResult))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxKeywordResult>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxKeywordResult))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keyword) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordResult),
            "::",
            stringify!(keyword)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordResult),
            "::",
            stringify!(tokens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens_arr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordResult),
            "::",
            stringify!(tokens_arr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordResult),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamps) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordResult),
            "::",
            stringify!(timestamps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_time) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordResult),
            "::",
            stringify!(start_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).json) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordResult),
            "::",
            stringify!(json)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxKeywordSpotterConfig {
    pub feat_config: SherpaOnnxFeatureConfig,
    pub model_config: SherpaOnnxOnlineModelConfig,
    pub max_active_paths: i32,
    pub num_trailing_blanks: i32,
    pub keywords_score: f32,
    pub keywords_threshold: f32,
    pub keywords_file: *const ::std::os::raw::c_char,
    #[doc = " if non-null, loading the keywords from the buffer instead of from the\n keywords_file"]
    pub keywords_buf: *const ::std::os::raw::c_char,
    #[doc = " byte size excluding the trailing '\\0'"]
    pub keywords_buf_size: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxKeywordSpotterConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxKeywordSpotterConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxKeywordSpotterConfig>(),
        184usize,
        concat!("Size of: ", stringify!(SherpaOnnxKeywordSpotterConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxKeywordSpotterConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxKeywordSpotterConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).feat_config) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordSpotterConfig),
            "::",
            stringify!(feat_config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model_config) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordSpotterConfig),
            "::",
            stringify!(model_config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_active_paths) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordSpotterConfig),
            "::",
            stringify!(max_active_paths)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_trailing_blanks) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordSpotterConfig),
            "::",
            stringify!(num_trailing_blanks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keywords_score) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordSpotterConfig),
            "::",
            stringify!(keywords_score)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keywords_threshold) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordSpotterConfig),
            "::",
            stringify!(keywords_threshold)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keywords_file) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordSpotterConfig),
            "::",
            stringify!(keywords_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keywords_buf) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordSpotterConfig),
            "::",
            stringify!(keywords_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keywords_buf_size) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxKeywordSpotterConfig),
            "::",
            stringify!(keywords_buf_size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxKeywordSpotter {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " @param config  Config for the keyword spotter.\n @return Return a pointer to the spotter. The user has to invoke\n         SherpaOnnxDestroyKeywordSpotter() to free it to avoid memory leak."]
    pub fn SherpaOnnxCreateKeywordSpotter(
        config: *const SherpaOnnxKeywordSpotterConfig,
    ) -> *const SherpaOnnxKeywordSpotter;
}
extern "C" {
    #[doc = " Free a pointer returned by SherpaOnnxCreateKeywordSpotter()\n\n @param p A pointer returned by SherpaOnnxCreateKeywordSpotter()"]
    pub fn SherpaOnnxDestroyKeywordSpotter(spotter: *const SherpaOnnxKeywordSpotter);
}
extern "C" {
    #[doc = " Create an online stream for accepting wave samples.\n\n @param spotter A pointer returned by SherpaOnnxCreateKeywordSpotter()\n @return Return a pointer to an OnlineStream. The user has to invoke\n         SherpaOnnxDestroyOnlineStream() to free it to avoid memory leak."]
    pub fn SherpaOnnxCreateKeywordStream(
        spotter: *const SherpaOnnxKeywordSpotter,
    ) -> *const SherpaOnnxOnlineStream;
}
extern "C" {
    #[doc = " Create an online stream for accepting wave samples with the specified hot\n words.\n\n @param spotter A pointer returned by SherpaOnnxCreateKeywordSpotter()\n @param keywords A pointer points to the keywords that you set\n @return Return a pointer to an OnlineStream. The user has to invoke\n         SherpaOnnxDestroyOnlineStream() to free it to avoid memory leak."]
    pub fn SherpaOnnxCreateKeywordStreamWithKeywords(
        spotter: *const SherpaOnnxKeywordSpotter,
        keywords: *const ::std::os::raw::c_char,
    ) -> *const SherpaOnnxOnlineStream;
}
extern "C" {
    #[doc = " Return 1 if there are enough number of feature frames for decoding.\n Return 0 otherwise.\n\n @param spotter A pointer returned by SherpaOnnxCreateKeywordSpotter\n @param stream  A pointer returned by SherpaOnnxCreateKeywordStream"]
    pub fn SherpaOnnxIsKeywordStreamReady(
        spotter: *const SherpaOnnxKeywordSpotter,
        stream: *const SherpaOnnxOnlineStream,
    ) -> i32;
}
extern "C" {
    #[doc = " Precondition for this function: SherpaOnnxIsKeywordStreamReady() MUST\n return 1."]
    pub fn SherpaOnnxDecodeKeywordStream(
        spotter: *const SherpaOnnxKeywordSpotter,
        stream: *const SherpaOnnxOnlineStream,
    );
}
extern "C" {
    #[doc = " Please call it right after a keyword is detected"]
    pub fn SherpaOnnxResetKeywordStream(
        spotter: *const SherpaOnnxKeywordSpotter,
        stream: *const SherpaOnnxOnlineStream,
    );
}
extern "C" {
    #[doc = " This function is similar to SherpaOnnxDecodeKeywordStream(). It decodes\n multiple OnlineStream in parallel.\n\n Caution: The caller has to ensure each OnlineStream is ready, i.e.,\n SherpaOnnxIsKeywordStreamReady() for that stream should return 1.\n\n @param spotter A pointer returned by SherpaOnnxCreateKeywordSpotter()\n @param streams  A pointer array containing pointers returned by\n                 SherpaOnnxCreateKeywordStream()\n @param n  Number of elements in the given streams array."]
    pub fn SherpaOnnxDecodeMultipleKeywordStreams(
        spotter: *const SherpaOnnxKeywordSpotter,
        streams: *mut *const SherpaOnnxOnlineStream,
        n: i32,
    );
}
extern "C" {
    #[doc = " Get the decoding results so far for an OnlineStream.\n\n @param spotter A pointer returned by SherpaOnnxCreateKeywordSpotter().\n @param stream A pointer returned by SherpaOnnxCreateKeywordStream().\n @return A pointer containing the result. The user has to invoke\n         SherpaOnnxDestroyKeywordResult() to free the returned pointer to\n         avoid memory leak."]
    pub fn SherpaOnnxGetKeywordResult(
        spotter: *const SherpaOnnxKeywordSpotter,
        stream: *const SherpaOnnxOnlineStream,
    ) -> *const SherpaOnnxKeywordResult;
}
extern "C" {
    #[doc = " Destroy the pointer returned by SherpaOnnxGetKeywordResult().\n\n @param r A pointer returned by SherpaOnnxGetKeywordResult()"]
    pub fn SherpaOnnxDestroyKeywordResult(r: *const SherpaOnnxKeywordResult);
}
extern "C" {
    pub fn SherpaOnnxGetKeywordResultAsJson(
        spotter: *const SherpaOnnxKeywordSpotter,
        stream: *const SherpaOnnxOnlineStream,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn SherpaOnnxFreeKeywordResultJson(s: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSileroVadModelConfig {
    pub model: *const ::std::os::raw::c_char,
    pub threshold: f32,
    pub min_silence_duration: f32,
    pub min_speech_duration: f32,
    pub window_size: i32,
    pub max_speech_duration: f32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxSileroVadModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxSileroVadModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxSileroVadModelConfig>(),
        32usize,
        concat!("Size of: ", stringify!(SherpaOnnxSileroVadModelConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxSileroVadModelConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxSileroVadModelConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSileroVadModelConfig),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).threshold) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSileroVadModelConfig),
            "::",
            stringify!(threshold)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_silence_duration) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSileroVadModelConfig),
            "::",
            stringify!(min_silence_duration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_speech_duration) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSileroVadModelConfig),
            "::",
            stringify!(min_speech_duration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).window_size) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSileroVadModelConfig),
            "::",
            stringify!(window_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_speech_duration) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSileroVadModelConfig),
            "::",
            stringify!(max_speech_duration)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxTenVadModelConfig {
    pub model: *const ::std::os::raw::c_char,
    pub threshold: f32,
    pub min_silence_duration: f32,
    pub min_speech_duration: f32,
    pub window_size: i32,
    pub max_speech_duration: f32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxTenVadModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxTenVadModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxTenVadModelConfig>(),
        32usize,
        concat!("Size of: ", stringify!(SherpaOnnxTenVadModelConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxTenVadModelConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxTenVadModelConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxTenVadModelConfig),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).threshold) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxTenVadModelConfig),
            "::",
            stringify!(threshold)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_silence_duration) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxTenVadModelConfig),
            "::",
            stringify!(min_silence_duration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_speech_duration) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxTenVadModelConfig),
            "::",
            stringify!(min_speech_duration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).window_size) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxTenVadModelConfig),
            "::",
            stringify!(window_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_speech_duration) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxTenVadModelConfig),
            "::",
            stringify!(max_speech_duration)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxVadModelConfig {
    pub silero_vad: SherpaOnnxSileroVadModelConfig,
    pub sample_rate: i32,
    pub num_threads: i32,
    pub provider: *const ::std::os::raw::c_char,
    pub debug: i32,
    pub ten_vad: SherpaOnnxTenVadModelConfig,
}
#[test]
fn bindgen_test_layout_SherpaOnnxVadModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxVadModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxVadModelConfig>(),
        88usize,
        concat!("Size of: ", stringify!(SherpaOnnxVadModelConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxVadModelConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxVadModelConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).silero_vad) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxVadModelConfig),
            "::",
            stringify!(silero_vad)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample_rate) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxVadModelConfig),
            "::",
            stringify!(sample_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_threads) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxVadModelConfig),
            "::",
            stringify!(num_threads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).provider) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxVadModelConfig),
            "::",
            stringify!(provider)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debug) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxVadModelConfig),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ten_vad) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxVadModelConfig),
            "::",
            stringify!(ten_vad)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxCircularBuffer {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SherpaOnnxCreateCircularBuffer(capacity: i32) -> *const SherpaOnnxCircularBuffer;
}
extern "C" {
    pub fn SherpaOnnxDestroyCircularBuffer(buffer: *const SherpaOnnxCircularBuffer);
}
extern "C" {
    pub fn SherpaOnnxCircularBufferPush(
        buffer: *const SherpaOnnxCircularBuffer,
        p: *const f32,
        n: i32,
    );
}
extern "C" {
    pub fn SherpaOnnxCircularBufferGet(
        buffer: *const SherpaOnnxCircularBuffer,
        start_index: i32,
        n: i32,
    ) -> *const f32;
}
extern "C" {
    pub fn SherpaOnnxCircularBufferFree(p: *const f32);
}
extern "C" {
    pub fn SherpaOnnxCircularBufferPop(buffer: *const SherpaOnnxCircularBuffer, n: i32);
}
extern "C" {
    pub fn SherpaOnnxCircularBufferSize(buffer: *const SherpaOnnxCircularBuffer) -> i32;
}
extern "C" {
    pub fn SherpaOnnxCircularBufferHead(buffer: *const SherpaOnnxCircularBuffer) -> i32;
}
extern "C" {
    pub fn SherpaOnnxCircularBufferReset(buffer: *const SherpaOnnxCircularBuffer);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpeechSegment {
    pub start: i32,
    pub samples: *mut f32,
    pub n: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxSpeechSegment() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxSpeechSegment> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxSpeechSegment>(),
        24usize,
        concat!("Size of: ", stringify!(SherpaOnnxSpeechSegment))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxSpeechSegment>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxSpeechSegment))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpeechSegment),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).samples) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpeechSegment),
            "::",
            stringify!(samples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpeechSegment),
            "::",
            stringify!(n)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxVoiceActivityDetector {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SherpaOnnxCreateVoiceActivityDetector(
        config: *const SherpaOnnxVadModelConfig,
        buffer_size_in_seconds: f32,
    ) -> *const SherpaOnnxVoiceActivityDetector;
}
extern "C" {
    pub fn SherpaOnnxDestroyVoiceActivityDetector(p: *const SherpaOnnxVoiceActivityDetector);
}
extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorAcceptWaveform(
        p: *const SherpaOnnxVoiceActivityDetector,
        samples: *const f32,
        n: i32,
    );
}
extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorEmpty(p: *const SherpaOnnxVoiceActivityDetector) -> i32;
}
extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorDetected(
        p: *const SherpaOnnxVoiceActivityDetector,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorPop(p: *const SherpaOnnxVoiceActivityDetector);
}
extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorClear(p: *const SherpaOnnxVoiceActivityDetector);
}
extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorFront(
        p: *const SherpaOnnxVoiceActivityDetector,
    ) -> *const SherpaOnnxSpeechSegment;
}
extern "C" {
    pub fn SherpaOnnxDestroySpeechSegment(p: *const SherpaOnnxSpeechSegment);
}
extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorReset(p: *const SherpaOnnxVoiceActivityDetector);
}
extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorFlush(p: *const SherpaOnnxVoiceActivityDetector);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsVitsModelConfig {
    pub model: *const ::std::os::raw::c_char,
    pub lexicon: *const ::std::os::raw::c_char,
    pub tokens: *const ::std::os::raw::c_char,
    pub data_dir: *const ::std::os::raw::c_char,
    pub noise_scale: f32,
    pub noise_scale_w: f32,
    pub length_scale: f32,
    pub dict_dir: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineTtsVitsModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineTtsVitsModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineTtsVitsModelConfig>(),
        56usize,
        concat!("Size of: ", stringify!(SherpaOnnxOfflineTtsVitsModelConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineTtsVitsModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineTtsVitsModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsVitsModelConfig),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lexicon) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsVitsModelConfig),
            "::",
            stringify!(lexicon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsVitsModelConfig),
            "::",
            stringify!(tokens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_dir) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsVitsModelConfig),
            "::",
            stringify!(data_dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).noise_scale) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsVitsModelConfig),
            "::",
            stringify!(noise_scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).noise_scale_w) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsVitsModelConfig),
            "::",
            stringify!(noise_scale_w)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length_scale) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsVitsModelConfig),
            "::",
            stringify!(length_scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dict_dir) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsVitsModelConfig),
            "::",
            stringify!(dict_dir)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsMatchaModelConfig {
    pub acoustic_model: *const ::std::os::raw::c_char,
    pub vocoder: *const ::std::os::raw::c_char,
    pub lexicon: *const ::std::os::raw::c_char,
    pub tokens: *const ::std::os::raw::c_char,
    pub data_dir: *const ::std::os::raw::c_char,
    pub noise_scale: f32,
    pub length_scale: f32,
    pub dict_dir: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineTtsMatchaModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineTtsMatchaModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineTtsMatchaModelConfig>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineTtsMatchaModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineTtsMatchaModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineTtsMatchaModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acoustic_model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsMatchaModelConfig),
            "::",
            stringify!(acoustic_model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vocoder) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsMatchaModelConfig),
            "::",
            stringify!(vocoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lexicon) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsMatchaModelConfig),
            "::",
            stringify!(lexicon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsMatchaModelConfig),
            "::",
            stringify!(tokens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_dir) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsMatchaModelConfig),
            "::",
            stringify!(data_dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).noise_scale) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsMatchaModelConfig),
            "::",
            stringify!(noise_scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length_scale) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsMatchaModelConfig),
            "::",
            stringify!(length_scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dict_dir) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsMatchaModelConfig),
            "::",
            stringify!(dict_dir)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsKokoroModelConfig {
    pub model: *const ::std::os::raw::c_char,
    pub voices: *const ::std::os::raw::c_char,
    pub tokens: *const ::std::os::raw::c_char,
    pub data_dir: *const ::std::os::raw::c_char,
    pub length_scale: f32,
    pub dict_dir: *const ::std::os::raw::c_char,
    pub lexicon: *const ::std::os::raw::c_char,
    pub lang: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineTtsKokoroModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineTtsKokoroModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineTtsKokoroModelConfig>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineTtsKokoroModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineTtsKokoroModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineTtsKokoroModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsKokoroModelConfig),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).voices) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsKokoroModelConfig),
            "::",
            stringify!(voices)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsKokoroModelConfig),
            "::",
            stringify!(tokens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_dir) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsKokoroModelConfig),
            "::",
            stringify!(data_dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length_scale) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsKokoroModelConfig),
            "::",
            stringify!(length_scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dict_dir) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsKokoroModelConfig),
            "::",
            stringify!(dict_dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lexicon) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsKokoroModelConfig),
            "::",
            stringify!(lexicon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lang) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsKokoroModelConfig),
            "::",
            stringify!(lang)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsKittenModelConfig {
    pub model: *const ::std::os::raw::c_char,
    pub voices: *const ::std::os::raw::c_char,
    pub tokens: *const ::std::os::raw::c_char,
    pub data_dir: *const ::std::os::raw::c_char,
    pub length_scale: f32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineTtsKittenModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineTtsKittenModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineTtsKittenModelConfig>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineTtsKittenModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineTtsKittenModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineTtsKittenModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsKittenModelConfig),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).voices) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsKittenModelConfig),
            "::",
            stringify!(voices)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsKittenModelConfig),
            "::",
            stringify!(tokens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_dir) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsKittenModelConfig),
            "::",
            stringify!(data_dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length_scale) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsKittenModelConfig),
            "::",
            stringify!(length_scale)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsZipvoiceModelConfig {
    pub tokens: *const ::std::os::raw::c_char,
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
    pub vocoder: *const ::std::os::raw::c_char,
    pub data_dir: *const ::std::os::raw::c_char,
    pub lexicon: *const ::std::os::raw::c_char,
    pub feat_scale: f32,
    pub t_shift: f32,
    pub target_rms: f32,
    pub guidance_scale: f32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineTtsZipvoiceModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineTtsZipvoiceModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineTtsZipvoiceModelConfig>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineTtsZipvoiceModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineTtsZipvoiceModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineTtsZipvoiceModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsZipvoiceModelConfig),
            "::",
            stringify!(tokens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoder) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsZipvoiceModelConfig),
            "::",
            stringify!(encoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decoder) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsZipvoiceModelConfig),
            "::",
            stringify!(decoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vocoder) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsZipvoiceModelConfig),
            "::",
            stringify!(vocoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_dir) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsZipvoiceModelConfig),
            "::",
            stringify!(data_dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lexicon) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsZipvoiceModelConfig),
            "::",
            stringify!(lexicon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).feat_scale) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsZipvoiceModelConfig),
            "::",
            stringify!(feat_scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_shift) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsZipvoiceModelConfig),
            "::",
            stringify!(t_shift)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_rms) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsZipvoiceModelConfig),
            "::",
            stringify!(target_rms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guidance_scale) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsZipvoiceModelConfig),
            "::",
            stringify!(guidance_scale)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsPocketModelConfig {
    pub lm_flow: *const ::std::os::raw::c_char,
    pub lm_main: *const ::std::os::raw::c_char,
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
    pub text_conditioner: *const ::std::os::raw::c_char,
    pub vocab_json: *const ::std::os::raw::c_char,
    pub token_scores_json: *const ::std::os::raw::c_char,
    pub voice_embedding_cache_capacity: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineTtsPocketModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineTtsPocketModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineTtsPocketModelConfig>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineTtsPocketModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineTtsPocketModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineTtsPocketModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lm_flow) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsPocketModelConfig),
            "::",
            stringify!(lm_flow)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lm_main) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsPocketModelConfig),
            "::",
            stringify!(lm_main)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoder) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsPocketModelConfig),
            "::",
            stringify!(encoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decoder) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsPocketModelConfig),
            "::",
            stringify!(decoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).text_conditioner) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsPocketModelConfig),
            "::",
            stringify!(text_conditioner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vocab_json) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsPocketModelConfig),
            "::",
            stringify!(vocab_json)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token_scores_json) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsPocketModelConfig),
            "::",
            stringify!(token_scores_json)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).voice_embedding_cache_capacity) as usize - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsPocketModelConfig),
            "::",
            stringify!(voice_embedding_cache_capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsModelConfig {
    pub vits: SherpaOnnxOfflineTtsVitsModelConfig,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
    pub matcha: SherpaOnnxOfflineTtsMatchaModelConfig,
    pub kokoro: SherpaOnnxOfflineTtsKokoroModelConfig,
    pub kitten: SherpaOnnxOfflineTtsKittenModelConfig,
    pub zipvoice: SherpaOnnxOfflineTtsZipvoiceModelConfig,
    pub pocket: SherpaOnnxOfflineTtsPocketModelConfig,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineTtsModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineTtsModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineTtsModelConfig>(),
        360usize,
        concat!("Size of: ", stringify!(SherpaOnnxOfflineTtsModelConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineTtsModelConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxOfflineTtsModelConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsModelConfig),
            "::",
            stringify!(vits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_threads) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsModelConfig),
            "::",
            stringify!(num_threads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debug) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsModelConfig),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).provider) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsModelConfig),
            "::",
            stringify!(provider)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).matcha) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsModelConfig),
            "::",
            stringify!(matcha)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).kokoro) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsModelConfig),
            "::",
            stringify!(kokoro)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).kitten) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsModelConfig),
            "::",
            stringify!(kitten)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zipvoice) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsModelConfig),
            "::",
            stringify!(zipvoice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pocket) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsModelConfig),
            "::",
            stringify!(pocket)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsConfig {
    pub model: SherpaOnnxOfflineTtsModelConfig,
    pub rule_fsts: *const ::std::os::raw::c_char,
    pub max_num_sentences: i32,
    pub rule_fars: *const ::std::os::raw::c_char,
    pub silence_scale: f32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineTtsConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineTtsConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineTtsConfig>(),
        392usize,
        concat!("Size of: ", stringify!(SherpaOnnxOfflineTtsConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineTtsConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxOfflineTtsConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsConfig),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rule_fsts) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsConfig),
            "::",
            stringify!(rule_fsts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_num_sentences) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsConfig),
            "::",
            stringify!(max_num_sentences)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rule_fars) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsConfig),
            "::",
            stringify!(rule_fars)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).silence_scale) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineTtsConfig),
            "::",
            stringify!(silence_scale)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxGeneratedAudio {
    pub samples: *const f32,
    pub n: i32,
    pub sample_rate: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxGeneratedAudio() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxGeneratedAudio> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxGeneratedAudio>(),
        16usize,
        concat!("Size of: ", stringify!(SherpaOnnxGeneratedAudio))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxGeneratedAudio>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxGeneratedAudio))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).samples) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxGeneratedAudio),
            "::",
            stringify!(samples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxGeneratedAudio),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample_rate) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxGeneratedAudio),
            "::",
            stringify!(sample_rate)
        )
    );
}
pub type SherpaOnnxGeneratedAudioCallback =
    ::std::option::Option<unsafe extern "C" fn(samples: *const f32, n: i32) -> i32>;
pub type SherpaOnnxGeneratedAudioCallbackWithArg = ::std::option::Option<
    unsafe extern "C" fn(samples: *const f32, n: i32, arg: *mut ::std::os::raw::c_void) -> i32,
>;
pub type SherpaOnnxGeneratedAudioProgressCallback =
    ::std::option::Option<unsafe extern "C" fn(samples: *const f32, n: i32, p: f32) -> i32>;
pub type SherpaOnnxGeneratedAudioProgressCallbackWithArg = ::std::option::Option<
    unsafe extern "C" fn(
        samples: *const f32,
        n: i32,
        p: f32,
        arg: *mut ::std::os::raw::c_void,
    ) -> i32,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTts {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SherpaOnnxCreateOfflineTts(
        config: *const SherpaOnnxOfflineTtsConfig,
    ) -> *const SherpaOnnxOfflineTts;
}
extern "C" {
    pub fn SherpaOnnxDestroyOfflineTts(tts: *const SherpaOnnxOfflineTts);
}
extern "C" {
    pub fn SherpaOnnxOfflineTtsSampleRate(tts: *const SherpaOnnxOfflineTts) -> i32;
}
extern "C" {
    pub fn SherpaOnnxOfflineTtsNumSpeakers(tts: *const SherpaOnnxOfflineTts) -> i32;
}
extern "C" {
    pub fn SherpaOnnxOfflineTtsGenerate(
        tts: *const SherpaOnnxOfflineTts,
        text: *const ::std::os::raw::c_char,
        sid: i32,
        speed: f32,
    ) -> *const SherpaOnnxGeneratedAudio;
}
extern "C" {
    pub fn SherpaOnnxOfflineTtsGenerateWithCallback(
        tts: *const SherpaOnnxOfflineTts,
        text: *const ::std::os::raw::c_char,
        sid: i32,
        speed: f32,
        callback: SherpaOnnxGeneratedAudioCallback,
    ) -> *const SherpaOnnxGeneratedAudio;
}
extern "C" {
    pub fn SherpaOnnxOfflineTtsGenerateWithProgressCallback(
        tts: *const SherpaOnnxOfflineTts,
        text: *const ::std::os::raw::c_char,
        sid: i32,
        speed: f32,
        callback: SherpaOnnxGeneratedAudioProgressCallback,
    ) -> *const SherpaOnnxGeneratedAudio;
}
extern "C" {
    pub fn SherpaOnnxOfflineTtsGenerateWithProgressCallbackWithArg(
        tts: *const SherpaOnnxOfflineTts,
        text: *const ::std::os::raw::c_char,
        sid: i32,
        speed: f32,
        callback: SherpaOnnxGeneratedAudioProgressCallbackWithArg,
        arg: *mut ::std::os::raw::c_void,
    ) -> *const SherpaOnnxGeneratedAudio;
}
extern "C" {
    pub fn SherpaOnnxOfflineTtsGenerateWithCallbackWithArg(
        tts: *const SherpaOnnxOfflineTts,
        text: *const ::std::os::raw::c_char,
        sid: i32,
        speed: f32,
        callback: SherpaOnnxGeneratedAudioCallbackWithArg,
        arg: *mut ::std::os::raw::c_void,
    ) -> *const SherpaOnnxGeneratedAudio;
}
extern "C" {
    pub fn SherpaOnnxOfflineTtsGenerateWithZipvoice(
        tts: *const SherpaOnnxOfflineTts,
        text: *const ::std::os::raw::c_char,
        prompt_text: *const ::std::os::raw::c_char,
        prompt_samples: *const f32,
        n_prompt: i32,
        prompt_sr: i32,
        speed: f32,
        num_steps: i32,
    ) -> *const SherpaOnnxGeneratedAudio;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxGenerationConfig {
    pub silence_scale: f32,
    pub speed: f32,
    pub sid: i32,
    pub reference_audio: *const f32,
    pub reference_audio_len: i32,
    pub reference_sample_rate: i32,
    pub reference_text: *const ::std::os::raw::c_char,
    pub num_steps: i32,
    pub extra: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxGenerationConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxGenerationConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxGenerationConfig>(),
        56usize,
        concat!("Size of: ", stringify!(SherpaOnnxGenerationConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxGenerationConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxGenerationConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).silence_scale) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxGenerationConfig),
            "::",
            stringify!(silence_scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).speed) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxGenerationConfig),
            "::",
            stringify!(speed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sid) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxGenerationConfig),
            "::",
            stringify!(sid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reference_audio) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxGenerationConfig),
            "::",
            stringify!(reference_audio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reference_audio_len) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxGenerationConfig),
            "::",
            stringify!(reference_audio_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reference_sample_rate) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxGenerationConfig),
            "::",
            stringify!(reference_sample_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reference_text) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxGenerationConfig),
            "::",
            stringify!(reference_text)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_steps) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxGenerationConfig),
            "::",
            stringify!(num_steps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extra) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxGenerationConfig),
            "::",
            stringify!(extra)
        )
    );
}
extern "C" {
    pub fn SherpaOnnxOfflineTtsGenerateWithConfig(
        tts: *const SherpaOnnxOfflineTts,
        text: *const ::std::os::raw::c_char,
        config: *const SherpaOnnxGenerationConfig,
        callback: SherpaOnnxGeneratedAudioProgressCallbackWithArg,
        arg: *mut ::std::os::raw::c_void,
    ) -> *const SherpaOnnxGeneratedAudio;
}
extern "C" {
    pub fn SherpaOnnxDestroyOfflineTtsGeneratedAudio(p: *const SherpaOnnxGeneratedAudio);
}
extern "C" {
    pub fn SherpaOnnxWriteWave(
        samples: *const f32,
        n: i32,
        sample_rate: i32,
        filename: *const ::std::os::raw::c_char,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxWaveFileSize(n_samples: i32) -> i64;
}
extern "C" {
    pub fn SherpaOnnxWriteWaveToBuffer(
        samples: *const f32,
        n: i32,
        sample_rate: i32,
        buffer: *mut ::std::os::raw::c_char,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxWave {
    pub samples: *const f32,
    pub sample_rate: i32,
    pub num_samples: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxWave() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxWave> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxWave>(),
        16usize,
        concat!("Size of: ", stringify!(SherpaOnnxWave))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxWave>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxWave))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).samples) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxWave),
            "::",
            stringify!(samples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample_rate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxWave),
            "::",
            stringify!(sample_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_samples) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxWave),
            "::",
            stringify!(num_samples)
        )
    );
}
extern "C" {
    pub fn SherpaOnnxReadWave(filename: *const ::std::os::raw::c_char) -> *const SherpaOnnxWave;
}
extern "C" {
    pub fn SherpaOnnxReadWaveFromBinaryData(
        data: *const ::std::os::raw::c_char,
        n: i32,
    ) -> *const SherpaOnnxWave;
}
extern "C" {
    pub fn SherpaOnnxFreeWave(wave: *const SherpaOnnxWave);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpokenLanguageIdentificationWhisperConfig {
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
    pub tail_paddings: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxSpokenLanguageIdentificationWhisperConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxSpokenLanguageIdentificationWhisperConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxSpokenLanguageIdentificationWhisperConfig>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxSpokenLanguageIdentificationWhisperConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxSpokenLanguageIdentificationWhisperConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxSpokenLanguageIdentificationWhisperConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoder) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpokenLanguageIdentificationWhisperConfig),
            "::",
            stringify!(encoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decoder) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpokenLanguageIdentificationWhisperConfig),
            "::",
            stringify!(decoder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tail_paddings) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpokenLanguageIdentificationWhisperConfig),
            "::",
            stringify!(tail_paddings)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpokenLanguageIdentificationConfig {
    pub whisper: SherpaOnnxSpokenLanguageIdentificationWhisperConfig,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxSpokenLanguageIdentificationConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxSpokenLanguageIdentificationConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxSpokenLanguageIdentificationConfig>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxSpokenLanguageIdentificationConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxSpokenLanguageIdentificationConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxSpokenLanguageIdentificationConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).whisper) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpokenLanguageIdentificationConfig),
            "::",
            stringify!(whisper)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_threads) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpokenLanguageIdentificationConfig),
            "::",
            stringify!(num_threads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debug) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpokenLanguageIdentificationConfig),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).provider) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpokenLanguageIdentificationConfig),
            "::",
            stringify!(provider)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpokenLanguageIdentification {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SherpaOnnxCreateSpokenLanguageIdentification(
        config: *const SherpaOnnxSpokenLanguageIdentificationConfig,
    ) -> *const SherpaOnnxSpokenLanguageIdentification;
}
extern "C" {
    pub fn SherpaOnnxDestroySpokenLanguageIdentification(
        slid: *const SherpaOnnxSpokenLanguageIdentification,
    );
}
extern "C" {
    pub fn SherpaOnnxSpokenLanguageIdentificationCreateOfflineStream(
        slid: *const SherpaOnnxSpokenLanguageIdentification,
    ) -> *mut SherpaOnnxOfflineStream;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpokenLanguageIdentificationResult {
    pub lang: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxSpokenLanguageIdentificationResult() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxSpokenLanguageIdentificationResult> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxSpokenLanguageIdentificationResult>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxSpokenLanguageIdentificationResult)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxSpokenLanguageIdentificationResult>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxSpokenLanguageIdentificationResult)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lang) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpokenLanguageIdentificationResult),
            "::",
            stringify!(lang)
        )
    );
}
extern "C" {
    pub fn SherpaOnnxSpokenLanguageIdentificationCompute(
        slid: *const SherpaOnnxSpokenLanguageIdentification,
        s: *const SherpaOnnxOfflineStream,
    ) -> *const SherpaOnnxSpokenLanguageIdentificationResult;
}
extern "C" {
    pub fn SherpaOnnxDestroySpokenLanguageIdentificationResult(
        r: *const SherpaOnnxSpokenLanguageIdentificationResult,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpeakerEmbeddingExtractorConfig {
    pub model: *const ::std::os::raw::c_char,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxSpeakerEmbeddingExtractorConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxSpeakerEmbeddingExtractorConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxSpeakerEmbeddingExtractorConfig>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxSpeakerEmbeddingExtractorConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxSpeakerEmbeddingExtractorConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxSpeakerEmbeddingExtractorConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpeakerEmbeddingExtractorConfig),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_threads) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpeakerEmbeddingExtractorConfig),
            "::",
            stringify!(num_threads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debug) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpeakerEmbeddingExtractorConfig),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).provider) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpeakerEmbeddingExtractorConfig),
            "::",
            stringify!(provider)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpeakerEmbeddingExtractor {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SherpaOnnxCreateSpeakerEmbeddingExtractor(
        config: *const SherpaOnnxSpeakerEmbeddingExtractorConfig,
    ) -> *const SherpaOnnxSpeakerEmbeddingExtractor;
}
extern "C" {
    pub fn SherpaOnnxDestroySpeakerEmbeddingExtractor(
        p: *const SherpaOnnxSpeakerEmbeddingExtractor,
    );
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingExtractorDim(
        p: *const SherpaOnnxSpeakerEmbeddingExtractor,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingExtractorCreateStream(
        p: *const SherpaOnnxSpeakerEmbeddingExtractor,
    ) -> *const SherpaOnnxOnlineStream;
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingExtractorIsReady(
        p: *const SherpaOnnxSpeakerEmbeddingExtractor,
        s: *const SherpaOnnxOnlineStream,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingExtractorComputeEmbedding(
        p: *const SherpaOnnxSpeakerEmbeddingExtractor,
        s: *const SherpaOnnxOnlineStream,
    ) -> *const f32;
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingExtractorDestroyEmbedding(v: *const f32);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpeakerEmbeddingManager {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SherpaOnnxCreateSpeakerEmbeddingManager(
        dim: i32,
    ) -> *const SherpaOnnxSpeakerEmbeddingManager;
}
extern "C" {
    pub fn SherpaOnnxDestroySpeakerEmbeddingManager(p: *const SherpaOnnxSpeakerEmbeddingManager);
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerAdd(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        name: *const ::std::os::raw::c_char,
        v: *const f32,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerAddList(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        name: *const ::std::os::raw::c_char,
        v: *mut *const f32,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerAddListFlattened(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        name: *const ::std::os::raw::c_char,
        v: *const f32,
        n: i32,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerRemove(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        name: *const ::std::os::raw::c_char,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerSearch(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        v: *const f32,
        threshold: f32,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerFreeSearch(name: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch {
    pub score: f32,
    pub name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).score) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch),
            "::",
            stringify!(score)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult {
    pub matches: *const SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch,
    pub count: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).matches) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult),
            "::",
            stringify!(matches)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult),
            "::",
            stringify!(count)
        )
    );
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerGetBestMatches(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        v: *const f32,
        threshold: f32,
        n: i32,
    ) -> *const SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult;
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerFreeBestMatches(
        r: *const SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult,
    );
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerVerify(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        name: *const ::std::os::raw::c_char,
        v: *const f32,
        threshold: f32,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerContains(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        name: *const ::std::os::raw::c_char,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerNumSpeakers(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerGetAllSpeakers(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
    ) -> *const *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerFreeAllSpeakers(
        names: *const *const ::std::os::raw::c_char,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineZipformerAudioTaggingModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineZipformerAudioTaggingModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineZipformerAudioTaggingModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineZipformerAudioTaggingModelConfig>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineZipformerAudioTaggingModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineZipformerAudioTaggingModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineZipformerAudioTaggingModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineZipformerAudioTaggingModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxAudioTaggingModelConfig {
    pub zipformer: SherpaOnnxOfflineZipformerAudioTaggingModelConfig,
    pub ced: *const ::std::os::raw::c_char,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxAudioTaggingModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxAudioTaggingModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxAudioTaggingModelConfig>(),
        32usize,
        concat!("Size of: ", stringify!(SherpaOnnxAudioTaggingModelConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxAudioTaggingModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxAudioTaggingModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zipformer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxAudioTaggingModelConfig),
            "::",
            stringify!(zipformer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ced) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxAudioTaggingModelConfig),
            "::",
            stringify!(ced)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_threads) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxAudioTaggingModelConfig),
            "::",
            stringify!(num_threads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debug) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxAudioTaggingModelConfig),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).provider) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxAudioTaggingModelConfig),
            "::",
            stringify!(provider)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxAudioTaggingConfig {
    pub model: SherpaOnnxAudioTaggingModelConfig,
    pub labels: *const ::std::os::raw::c_char,
    pub top_k: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxAudioTaggingConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxAudioTaggingConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxAudioTaggingConfig>(),
        48usize,
        concat!("Size of: ", stringify!(SherpaOnnxAudioTaggingConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxAudioTaggingConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxAudioTaggingConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxAudioTaggingConfig),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).labels) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxAudioTaggingConfig),
            "::",
            stringify!(labels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).top_k) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxAudioTaggingConfig),
            "::",
            stringify!(top_k)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxAudioEvent {
    pub name: *const ::std::os::raw::c_char,
    pub index: i32,
    pub prob: f32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxAudioEvent() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxAudioEvent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxAudioEvent>(),
        16usize,
        concat!("Size of: ", stringify!(SherpaOnnxAudioEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxAudioEvent>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxAudioEvent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxAudioEvent),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxAudioEvent),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prob) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxAudioEvent),
            "::",
            stringify!(prob)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxAudioTagging {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SherpaOnnxCreateAudioTagging(
        config: *const SherpaOnnxAudioTaggingConfig,
    ) -> *const SherpaOnnxAudioTagging;
}
extern "C" {
    pub fn SherpaOnnxDestroyAudioTagging(tagger: *const SherpaOnnxAudioTagging);
}
extern "C" {
    pub fn SherpaOnnxAudioTaggingCreateOfflineStream(
        tagger: *const SherpaOnnxAudioTagging,
    ) -> *const SherpaOnnxOfflineStream;
}
extern "C" {
    pub fn SherpaOnnxAudioTaggingCompute(
        tagger: *const SherpaOnnxAudioTagging,
        s: *const SherpaOnnxOfflineStream,
        top_k: i32,
    ) -> *const *const SherpaOnnxAudioEvent;
}
extern "C" {
    pub fn SherpaOnnxAudioTaggingFreeResults(p: *const *const SherpaOnnxAudioEvent);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflinePunctuationModelConfig {
    pub ct_transformer: *const ::std::os::raw::c_char,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflinePunctuationModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflinePunctuationModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflinePunctuationModelConfig>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflinePunctuationModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflinePunctuationModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflinePunctuationModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ct_transformer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflinePunctuationModelConfig),
            "::",
            stringify!(ct_transformer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_threads) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflinePunctuationModelConfig),
            "::",
            stringify!(num_threads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debug) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflinePunctuationModelConfig),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).provider) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflinePunctuationModelConfig),
            "::",
            stringify!(provider)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflinePunctuationConfig {
    pub model: SherpaOnnxOfflinePunctuationModelConfig,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflinePunctuationConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflinePunctuationConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflinePunctuationConfig>(),
        24usize,
        concat!("Size of: ", stringify!(SherpaOnnxOfflinePunctuationConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflinePunctuationConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflinePunctuationConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflinePunctuationConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflinePunctuation {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SherpaOnnxCreateOfflinePunctuation(
        config: *const SherpaOnnxOfflinePunctuationConfig,
    ) -> *const SherpaOnnxOfflinePunctuation;
}
extern "C" {
    pub fn SherpaOnnxDestroyOfflinePunctuation(punct: *const SherpaOnnxOfflinePunctuation);
}
extern "C" {
    pub fn SherpaOfflinePunctuationAddPunct(
        punct: *const SherpaOnnxOfflinePunctuation,
        text: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn SherpaOfflinePunctuationFreeText(text: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlinePunctuationModelConfig {
    pub cnn_bilstm: *const ::std::os::raw::c_char,
    pub bpe_vocab: *const ::std::os::raw::c_char,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOnlinePunctuationModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOnlinePunctuationModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOnlinePunctuationModelConfig>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOnlinePunctuationModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOnlinePunctuationModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOnlinePunctuationModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cnn_bilstm) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlinePunctuationModelConfig),
            "::",
            stringify!(cnn_bilstm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bpe_vocab) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlinePunctuationModelConfig),
            "::",
            stringify!(bpe_vocab)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_threads) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlinePunctuationModelConfig),
            "::",
            stringify!(num_threads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debug) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlinePunctuationModelConfig),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).provider) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlinePunctuationModelConfig),
            "::",
            stringify!(provider)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlinePunctuationConfig {
    pub model: SherpaOnnxOnlinePunctuationModelConfig,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOnlinePunctuationConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOnlinePunctuationConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOnlinePunctuationConfig>(),
        32usize,
        concat!("Size of: ", stringify!(SherpaOnnxOnlinePunctuationConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOnlinePunctuationConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOnlinePunctuationConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOnlinePunctuationConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlinePunctuation {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SherpaOnnxCreateOnlinePunctuation(
        config: *const SherpaOnnxOnlinePunctuationConfig,
    ) -> *const SherpaOnnxOnlinePunctuation;
}
extern "C" {
    pub fn SherpaOnnxDestroyOnlinePunctuation(punctuation: *const SherpaOnnxOnlinePunctuation);
}
extern "C" {
    pub fn SherpaOnnxOnlinePunctuationAddPunct(
        punctuation: *const SherpaOnnxOnlinePunctuation,
        text: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn SherpaOnnxOnlinePunctuationFreeText(text: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxLinearResampler {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SherpaOnnxCreateLinearResampler(
        samp_rate_in_hz: i32,
        samp_rate_out_hz: i32,
        filter_cutoff_hz: f32,
        num_zeros: i32,
    ) -> *const SherpaOnnxLinearResampler;
}
extern "C" {
    pub fn SherpaOnnxDestroyLinearResampler(p: *const SherpaOnnxLinearResampler);
}
extern "C" {
    pub fn SherpaOnnxLinearResamplerReset(p: *const SherpaOnnxLinearResampler);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxResampleOut {
    pub samples: *const f32,
    pub n: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxResampleOut() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxResampleOut> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxResampleOut>(),
        16usize,
        concat!("Size of: ", stringify!(SherpaOnnxResampleOut))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxResampleOut>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxResampleOut))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).samples) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxResampleOut),
            "::",
            stringify!(samples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxResampleOut),
            "::",
            stringify!(n)
        )
    );
}
extern "C" {
    pub fn SherpaOnnxLinearResamplerResample(
        p: *const SherpaOnnxLinearResampler,
        input: *const f32,
        input_dim: i32,
        flush: i32,
    ) -> *const SherpaOnnxResampleOut;
}
extern "C" {
    pub fn SherpaOnnxLinearResamplerResampleFree(p: *const SherpaOnnxResampleOut);
}
extern "C" {
    pub fn SherpaOnnxLinearResamplerResampleGetInputSampleRate(
        p: *const SherpaOnnxLinearResampler,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxLinearResamplerResampleGetOutputSampleRate(
        p: *const SherpaOnnxLinearResampler,
    ) -> i32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeakerSegmentationModelConfig {
    pub pyannote: SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineSpeakerSegmentationModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineSpeakerSegmentationModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineSpeakerSegmentationModelConfig>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineSpeakerSegmentationModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineSpeakerSegmentationModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineSpeakerSegmentationModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pyannote) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeakerSegmentationModelConfig),
            "::",
            stringify!(pyannote)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_threads) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeakerSegmentationModelConfig),
            "::",
            stringify!(num_threads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debug) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeakerSegmentationModelConfig),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).provider) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeakerSegmentationModelConfig),
            "::",
            stringify!(provider)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxFastClusteringConfig {
    pub num_clusters: i32,
    pub threshold: f32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxFastClusteringConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxFastClusteringConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxFastClusteringConfig>(),
        8usize,
        concat!("Size of: ", stringify!(SherpaOnnxFastClusteringConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxFastClusteringConfig>(),
        4usize,
        concat!("Alignment of ", stringify!(SherpaOnnxFastClusteringConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_clusters) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxFastClusteringConfig),
            "::",
            stringify!(num_clusters)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).threshold) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxFastClusteringConfig),
            "::",
            stringify!(threshold)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeakerDiarizationConfig {
    pub segmentation: SherpaOnnxOfflineSpeakerSegmentationModelConfig,
    pub embedding: SherpaOnnxSpeakerEmbeddingExtractorConfig,
    pub clustering: SherpaOnnxFastClusteringConfig,
    pub min_duration_on: f32,
    pub min_duration_off: f32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineSpeakerDiarizationConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineSpeakerDiarizationConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineSpeakerDiarizationConfig>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineSpeakerDiarizationConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineSpeakerDiarizationConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineSpeakerDiarizationConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segmentation) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeakerDiarizationConfig),
            "::",
            stringify!(segmentation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).embedding) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeakerDiarizationConfig),
            "::",
            stringify!(embedding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clustering) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeakerDiarizationConfig),
            "::",
            stringify!(clustering)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_duration_on) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeakerDiarizationConfig),
            "::",
            stringify!(min_duration_on)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_duration_off) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeakerDiarizationConfig),
            "::",
            stringify!(min_duration_off)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeakerDiarization {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SherpaOnnxCreateOfflineSpeakerDiarization(
        config: *const SherpaOnnxOfflineSpeakerDiarizationConfig,
    ) -> *const SherpaOnnxOfflineSpeakerDiarization;
}
extern "C" {
    pub fn SherpaOnnxDestroyOfflineSpeakerDiarization(
        sd: *const SherpaOnnxOfflineSpeakerDiarization,
    );
}
extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationGetSampleRate(
        sd: *const SherpaOnnxOfflineSpeakerDiarization,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationSetConfig(
        sd: *const SherpaOnnxOfflineSpeakerDiarization,
        config: *const SherpaOnnxOfflineSpeakerDiarizationConfig,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeakerDiarizationResult {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeakerDiarizationSegment {
    pub start: f32,
    pub end: f32,
    pub speaker: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineSpeakerDiarizationSegment() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineSpeakerDiarizationSegment> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineSpeakerDiarizationSegment>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineSpeakerDiarizationSegment)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineSpeakerDiarizationSegment>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineSpeakerDiarizationSegment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeakerDiarizationSegment),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeakerDiarizationSegment),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).speaker) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeakerDiarizationSegment),
            "::",
            stringify!(speaker)
        )
    );
}
extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationResultGetNumSpeakers(
        r: *const SherpaOnnxOfflineSpeakerDiarizationResult,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationResultGetNumSegments(
        r: *const SherpaOnnxOfflineSpeakerDiarizationResult,
    ) -> i32;
}
extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationResultSortByStartTime(
        r: *const SherpaOnnxOfflineSpeakerDiarizationResult,
    ) -> *const SherpaOnnxOfflineSpeakerDiarizationSegment;
}
extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationDestroySegment(
        s: *const SherpaOnnxOfflineSpeakerDiarizationSegment,
    );
}
pub type SherpaOnnxOfflineSpeakerDiarizationProgressCallback = ::std::option::Option<
    unsafe extern "C" fn(
        num_processed_chunks: i32,
        num_total_chunks: i32,
        arg: *mut ::std::os::raw::c_void,
    ) -> i32,
>;
pub type SherpaOnnxOfflineSpeakerDiarizationProgressCallbackNoArg = ::std::option::Option<
    unsafe extern "C" fn(num_processed_chunks: i32, num_total_chunks: i32) -> i32,
>;
extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationProcess(
        sd: *const SherpaOnnxOfflineSpeakerDiarization,
        samples: *const f32,
        n: i32,
    ) -> *const SherpaOnnxOfflineSpeakerDiarizationResult;
}
extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationProcessWithCallback(
        sd: *const SherpaOnnxOfflineSpeakerDiarization,
        samples: *const f32,
        n: i32,
        callback: SherpaOnnxOfflineSpeakerDiarizationProgressCallback,
        arg: *mut ::std::os::raw::c_void,
    ) -> *const SherpaOnnxOfflineSpeakerDiarizationResult;
}
extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationProcessWithCallbackNoArg(
        sd: *const SherpaOnnxOfflineSpeakerDiarization,
        samples: *const f32,
        n: i32,
        callback: SherpaOnnxOfflineSpeakerDiarizationProgressCallbackNoArg,
    ) -> *const SherpaOnnxOfflineSpeakerDiarizationResult;
}
extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationDestroyResult(
        r: *const SherpaOnnxOfflineSpeakerDiarizationResult,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeechDenoiserModelConfig {
    pub gtcrn: SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineSpeechDenoiserModelConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineSpeechDenoiserModelConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineSpeechDenoiserModelConfig>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineSpeechDenoiserModelConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineSpeechDenoiserModelConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineSpeechDenoiserModelConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gtcrn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeechDenoiserModelConfig),
            "::",
            stringify!(gtcrn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_threads) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeechDenoiserModelConfig),
            "::",
            stringify!(num_threads)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debug) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeechDenoiserModelConfig),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).provider) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeechDenoiserModelConfig),
            "::",
            stringify!(provider)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeechDenoiserConfig {
    pub model: SherpaOnnxOfflineSpeechDenoiserModelConfig,
}
#[test]
fn bindgen_test_layout_SherpaOnnxOfflineSpeechDenoiserConfig() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxOfflineSpeechDenoiserConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxOfflineSpeechDenoiserConfig>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(SherpaOnnxOfflineSpeechDenoiserConfig)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxOfflineSpeechDenoiserConfig>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SherpaOnnxOfflineSpeechDenoiserConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxOfflineSpeechDenoiserConfig),
            "::",
            stringify!(model)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeechDenoiser {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SherpaOnnxCreateOfflineSpeechDenoiser(
        config: *const SherpaOnnxOfflineSpeechDenoiserConfig,
    ) -> *const SherpaOnnxOfflineSpeechDenoiser;
}
extern "C" {
    pub fn SherpaOnnxDestroyOfflineSpeechDenoiser(sd: *const SherpaOnnxOfflineSpeechDenoiser);
}
extern "C" {
    pub fn SherpaOnnxOfflineSpeechDenoiserGetSampleRate(
        sd: *const SherpaOnnxOfflineSpeechDenoiser,
    ) -> i32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxDenoisedAudio {
    pub samples: *const f32,
    pub n: i32,
    pub sample_rate: i32,
}
#[test]
fn bindgen_test_layout_SherpaOnnxDenoisedAudio() {
    const UNINIT: ::std::mem::MaybeUninit<SherpaOnnxDenoisedAudio> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SherpaOnnxDenoisedAudio>(),
        16usize,
        concat!("Size of: ", stringify!(SherpaOnnxDenoisedAudio))
    );
    assert_eq!(
        ::std::mem::align_of::<SherpaOnnxDenoisedAudio>(),
        8usize,
        concat!("Alignment of ", stringify!(SherpaOnnxDenoisedAudio))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).samples) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxDenoisedAudio),
            "::",
            stringify!(samples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxDenoisedAudio),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample_rate) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SherpaOnnxDenoisedAudio),
            "::",
            stringify!(sample_rate)
        )
    );
}
extern "C" {
    pub fn SherpaOnnxOfflineSpeechDenoiserRun(
        sd: *const SherpaOnnxOfflineSpeechDenoiser,
        samples: *const f32,
        n: i32,
        sample_rate: i32,
    ) -> *const SherpaOnnxDenoisedAudio;
}
extern "C" {
    pub fn SherpaOnnxDestroyDenoisedAudio(p: *const SherpaOnnxDenoisedAudio);
}
